Repository: legoscia/ikiwiki
Catalog: po/underlays/index.*.po
Languages: fr

source: This wiki is used to translate ikiwiki's basewiki, and demonstrate those translations. [Ikiwiki](http://ikiwiki.info) is a wiki engine; its basewiki is the set of pages that are copied into every wiki it powers.
fr: Ce wiki sert à la traduction du « basewiki » de ikiwiki et montre comment faire cette traduction. [Ikiwiki](http://ikiwiki.info) est un moteur de wiki. Le « basewiki » est l'ensemble des pages qui sont copiées dans chaque wiki créé.

source: Most of the English pages on this wiki are locked. You cannot edit them. You can, however, edit the translated versions of those pages, and your edits to their PO files will be folded back into ikiwiki proper.
fr: La plupart des pages anglaises de ce wiki sont verrouillées. Vous ne pouvez pas les modifier. Vous pouvez par contre modifier les versions traduites de ces pages et les modifications sur les fichiers PO seront intégrées dans ikiwiki.

source: The [[SandBox]] is unlocked if you just want to play around with editing a translatable wiki.
fr: La page [[Sandbox]] n'est pas verrouillée au cas où vous voudriez vous amuser avec un wiki traduisible.

source: Instructions for translators
fr: Instructions aux traducteurs

source: If you want to translate ikiwiki's basewiki into your language, follow these steps:
fr: Si vous voulez traduire le « basewiki » d'ikiwiki dans votre langue, voici la démarche :

source: Note that the license of the basewiki is as follows. Your translation will need to be licensed the same:
fr: La licence du « basewiki » est la suivante et votre traduction devra être couverte par la même licence :

source: Now get to translating! The easiest way to get started is to find a page on this wiki that is less than 100% translated to your language, go to the translated version of the page, and edit it. You'll be dumped into a web form, editing a PO file. Save and watch the percent translated numbers go up!
fr: Maintenant, allons-y ! La meilleure façon de commencer est de prendre une page qui n'est pas encore entièrement traduite dans votre langue, d'aller sur la version à traduire de cette page et de l'éditer. Vous serez basculé dans une sorte de formulaire web qui permet de modifier le fichier PO. Enregistrez et regardez monter le pourcentage de traduction !

source: After a while you might get tired of the web form and want a real text editor, or even a specialized po file editor. No problem, this wiki can be edited using git as well:
fr: Par la suite vous serez peut-être fatigué de ce formulaire web et vous voudrez un véritable éditeur de textes, voire un éditeur spécialisé dans l'édition de fichiers PO. Pas de problème, ce wiki peut être également modifié avec git :

source: Install git, and run this command to check out the wiki: `git clone git://l10n.ikiwiki.info/`
fr: Installez git, et lancez cette commande pour copier le wiki : `git clone git://l10n.ikiwiki.info/` ;

source: Edit the po files for your language, in the `l10n.ikiwiki.info/po/underlays/` directory.
fr: Modifiez les fichiers PO de votre langue qui se trouvent dans le répertoire l10n.ikiwiki.info/po/underlays/ ;

source: Run `git commit -a` to commit your changes.
fr: Exécutez `git commit -a` pour enregistrer vos modifications ;

source: Run `git push` to push your changes back to this wiki. It will automatically update!
fr: Exécutez `git push` pour envoyer vos modifications sur ce wiki. Il sera automatiquement mis à jour !

source: If you get a useful percentage of the basewiki translated, let [[Joey]] know so he can activate your translation in the next ikiwiki release.
fr: Quand la traduction du « basewiki » sera suffisamment engagée, faites le savoir à [[Joey]] pour qu'il active la traduction dans la prochaine version d'ikiwiki.

source: Translation hints
fr: Aides pour la traduction

source: Don't translate page names inside [[WikiLinks|ikiwiki/WikiLink]], such as `\[[FooPage]]`
fr: Ne traduisez pas les noms de page à l'intérieur des [[WikiLinks|ikiwiki/WikiLink]], comme `\[[FooPage]]`

source: Do translate link **descriptions** inside WikiLinks, such as `\[[`**Page about foo**`|FooPage]]`
fr: Vous pouvez traduire les **descriptions** des liens dans les WikiLinks, comme `\[[`**Page sur foo** |FooPage]]`

source: Some [[directives|ikiwiki/directive]] don't contain **translatable bits**; some do. Compare `\[[!inline pages="blog/*"]]` with `\[[!inline pages="blog/*" description="`**this is my blog**`"]]`
fr: Certaines [[directives|ikiwiki/directive]] ne contiennent pas de **texte à traduire**, d'autres, oui. Comparez par exemple `\[[!inline pages="blog/*"]]` et `\[[!inline pages="blog/*" description="`**this is my blog**`"]]`

source: List of pages
fr: Liste des pages

source: Here is a list of all the translatable pages in the basewiki:
fr: Voici la liste de toutes les pages à traduire dans le « basewiki » :

source: If you manage to translate all of the above, here are some additional translatable pages:
fr: Pour ceux qui auront réussi à traduire toutes ces pages, voici d'autres pages à traduire :
